Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтудентРаботающийВСтудотряде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьНаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ПроцессыОбработкиДокументовЗарплата/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ПроцессыОбработкиДокументовФормы

Процедура ПриЧтенииНаСервере(Форма, ТекущийОбъект, ИмяГруппыДляРазмещения = "ГруппаПроцесс", ГруппаДляКнопкиПроцесс = Неопределено) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
		МодульПроцессыОбработкиДокументов = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументов");
		МодульПроцессыОбработкиДокументов.ПриЧтенииНаСервере(Форма, ТекущийОбъект, ИмяГруппыДляРазмещения, ГруппаДляКнопкиПроцесс);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриСозданииНаСервере(Форма, Источник, ИмяГруппыДляРазмещения = "ГруппаПроцесс", ГруппаДляКнопкиПроцесс = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Форма.ПолучитьДействие("ПередЗакрытием")) Тогда
		Форма.УстановитьДействие("ПередЗакрытием", "Подключаемый_ПередЗакрытием");
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
		МодульПроцессыОбработкиДокументов = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументов");
		МодульПроцессыОбработкиДокументов.ПриСозданииНаСервере(Форма, Источник, ИмяГруппыДляРазмещения, ГруппаДляКнопкиПроцесс);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписьюНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи, Отказ) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
		МодульПроцессыОбработкиДокументов = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументов");
		МодульПроцессыОбработкиДокументов.ПередЗаписьюНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
		МодульПроцессыОбработкиДокументов = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументов");
		МодульПроцессыОбработкиДокументов.ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьЗадачу(Форма, Контекст, Источник) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
		МодульПроцессыОбработкиДокументов = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументов");
		МодульПроцессыОбработкиДокументов.ВыполнитьЗадачу(Форма, Контекст, Источник);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриСозданииНаСервереФормыСписка(Форма, ИменаСписков, ИмяКолонки = "Статус", ЗаголовокКолонки = Неопределено, ПоложениеКолонки = Неопределено) Экспорт

	Если ОбщегоНазначения.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
		Если ПоложениеКолонки=Неопределено Тогда 
			ПоложениеКолонки = 999;
		КонецЕсли;
		МодульПроцессыОбработкиДокументов = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументов");
		МодульПроцессыОбработкиДокументов.ПриСозданииНаСервереФормыСписка(Форма, ИменаСписков, ИмяКолонки, ЗаголовокКолонки, ПоложениеКолонки);
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти  

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьДополнительныйОбработчик(Идентификатор, Параметры) Экспорт
	
   УстановитьБезопасныйРежим(Истина);
   Выполнить Идентификатор + "(Параметры)";
	
КонецПроцедуры

Процедура ПараметрыРаботыКлиентаПриЗапуске(Параметры) Экспорт

	Если ОбщегоНазначения.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
		МодульПроцессыОбработкиДокументов = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументов");
		МодульПроцессыОбработкиДокументов.ПараметрыРаботыКлиентаПриЗапуске(Параметры);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет сведения о физическом лице по переданному пользователю и перечню подписываемых объектов
// для заполнения свойств простой электронной подписи по каждому объекту.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - пользователь ИБ.
//  Сведения - Структура - данные пользователя:
//   * ПолноеИмя - Строка - полное имя физического лица пользователя, например "Иванов Иван Иванович".
//   * ОрганизацииИДолжности - Соответствие - данные пользователя по подписываемым объектам, где
//      Ключ - ДокументСсылка - подписываемый документ (уже заполнен),
//      Значение - Структура или Массив структур:
//       * Организация - ОпределяемыйТип.Организация - организация пользователя.
//       * Должность - Строка - занимаемая в организации должность.
//       Если вернуть массив структур, то в форме подписания простой ЭП будет доступен выбор пары "Организация - Должность"
//       Не допускается использование разных типов значений для разных элементов соответствия
//
Процедура ЗаполнитьСведенияОПользователе(Знач Пользователь, Сведения) Экспорт
	
	ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ФизическоеЛицо");
	
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	Сведения.ПолноеИмя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФизическоеЛицо, "ФИО");
	
	ВсеДокументы = Новый Массив;
	ДокументыСОрганизацией = Новый Массив;
	ДокументыБезОрганизации = Новый Соответствие;
	Для Каждого Сведение Из Сведения.ОрганизацииИДолжности Цикл
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Сведение.Ключ, "Организация") Тогда
			ДокументыСОрганизацией.Добавить(Сведение.Ключ);
		Иначе
			ДокументыБезОрганизации.Вставить(Сведение.Ключ, Истина);
		КонецЕсли;
		ВсеДокументы.Добавить(Сведение.Ключ);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.ГоловнаяОрганизация КАК Организация,
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ФизическоеЛицо = &ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	Сотрудники = Новый Массив;
	СотрудникиИОрганизации = Новый Соответствие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Сотрудники.Добавить(Выборка.Ссылка);
		СотрудникиИОрганизации.Вставить(Выборка.Ссылка, Выборка.Организация);
	КонецЦикла;
	
	ОрганизацииДокументов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ДокументыСОрганизацией, "Организация");
	
	КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Истина, Сотрудники, "Организация,Должность");

	ОрганизацииИДолжности = Новый Массив;
	Для Каждого ДанныеСотрудника Из КадровыеДанныеСотрудников Цикл
		ОрганизацияИДолжность = Новый Структура;
		ОрганизацияИДолжность.Вставить("Организация", ДанныеСотрудника.Организация);
		ОрганизацияИДолжность.Вставить("Должность", Строка(ДанныеСотрудника.Должность));
		ОрганизацииИДолжности.Добавить(ОрганизацияИДолжность);
	КонецЦикла;

	Для Каждого Документ Из ВсеДокументы Цикл
		Сведения.ОрганизацииИДолжности.Вставить(Документ, ОбщегоНазначения.СкопироватьРекурсивно(ОрганизацииИДолжности));
		Если ДокументыБезОрганизации.Получить(Документ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ОрганизацияДокумента = ОрганизацииДокументов[Документ];
		// Если есть несколько организаций и должностей, то первой надо поставить организацию из документа
		Для Индекс = 0 По Сведения.ОрганизацииИДолжности[Документ].ВГраница() Цикл
			ОрганизацияИДолжность = Сведения.ОрганизацииИДолжности[Документ][Индекс];
			Если ОрганизацияИДолжность.Организация = ОрганизацияДокумента Тогда
				Сведения.ОрганизацииИДолжности[Документ].Удалить(Индекс);
				Сведения.ОрганизацииИДолжности[Документ].Вставить(0, ОрганизацияИДолжность);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

#Область СозданиеНаОсновании

// Определяет список объектов конфигурации, в модулях менеджеров которых предусмотрена процедура 
// ДобавитьКомандыСозданияНаОсновании, формирующая команды создания на основании объектов.
// Синтаксис процедуры ДобавитьКомандыСозданияНаОсновании см. в документации.
//
// Параметры:
//   Объекты - Массив - объекты метаданных (ОбъектМетаданных) с командами создания на основании.
//
// Пример:
//  Объекты.Добавить(Метаданные.Справочники.Организации);
//
Процедура ПриОпределенииОбъектовСКомандамиСозданияНаОсновании(Объекты) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
		МодульПроцессыОбработкиДокументов = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументов");
		МодульПроцессыОбработкиДокументов.ПриОпределенииОбъектовСКомандамиСозданияНаОсновании(Объекты);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
		МодульПроцессыОбработкиДокументов = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументов");
		МодульПроцессыОбработкиДокументов.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных.
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
		МодульПроцессыОбработкиДокументов = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументов");
		МодульПроцессыОбработкиДокументов.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание);
	КонецЕсли;
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
		МодульПроцессыОбработкиДокументов = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументов");
		МодульПроцессыОбработкиДокументов.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// См. УправлениеПечатьюПереопределяемый.ПриОпределенииОбъектовСКомандамиПечати.
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
		МодульПроцессыОбработкиДокументов = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументов");
		МодульПроцессыОбработкиДокументов.ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов);
	КонецЕсли;
	
КонецПроцедуры

// См. УправлениеПечатьюПереопределяемый.ПриПечати.
Процедура ПриПечати(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
		МодульПроцессыОбработкиДокументов = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументов");
		МодульПроцессыОбработкиДокументов.ПриПечати(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
